In [25]:
import pandas as pd
import numpy as np

In [13]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Henry', 'Ivy', 'Jack'],
    'Age': [25, 30, 35, 28, 32, 27, 31, 29, 34, 26],
    'Qualification': ['Bachelor', 'Master', 'PhD', 'Master', 'Bachelor', 'Master', 'PhD', 'Bachelor', 'Master', 'PhD'],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Sydney', 'Toronto', 'Mumbai', 'Singapore', 'Dubai'],
    'Country': ['USA', 'UK', 'Japan', 'France', 'Germany', 'Australia', 'Canada', 'India', 'Singapore', 'UAE']
}

df = pd.DataFrame(data)

In [15]:
df

      Name  Age Qualification  Gender       City    Country
0    Alice   25      Bachelor  Female   New York        USA
1      Bob   30        Master    Male     London         UK
2  Charlie   35           PhD    Male      Tokyo      Japan
3    David   28        Master    Male      Paris     France
4      Eva   32      Bachelor  Female     Berlin    Germany
5    Frank   27        Master    Male     Sydney  Australia
6    Grace   31           PhD  Female    Toronto     Canada
7    Henry   29      Bachelor    Male     Mumbai      India
8      Ivy   34        Master  Female  Singapore  Singapore
9     Jack   26           PhD    Male      Dubai        UAE

In [25]:
df.Age.median()

29.5

In [27]:
import math
median_Age=math.floor(df.Age.median())
median_Age

29

In [31]:
import pandas as pd
dataset = [
    {'Name':'Rana','Roll':2237839,'Branch':'AIML'},
    {'Name':'Vijay','Roll':2237838,'Branch':'AIML'},
    {'Name':'Vibhor','Roll':2237837,'Branch':'AIML'}
    ]
df = pd.DataFrame(dataset)
df

     Name     Roll Branch
0    Rana  2237839   AIML
1   Vijay  2237838   AIML
2  Vibhor  2237837   AIML

In [41]:
df['Placement']=['Yes','No','Yes']
df['Grades']=['A+','B+','O+']
df['Attendance']=[90,89,93]

In [33]:
df

     Name     Roll Branch Placement Grades Attendance
0    Rana  2237839   AIML       Yes     A+         90
1   Vijay  2237838   AIML        No     B+         89
2  Vibhor  2237837   AIML       Yes     O+         93

In [20]:
df.drop('Attendance') #by default axis is 0

KeyError: "['Attendance'] not found in axis"

In [21]:
df.drop('Grades' , axis = 1) # temporary operation

     Name     Roll Branch Placement Attendance
0    Rana  2237839   AIML       Yes         90
1   Vijay  2237838   AIML        No         89
2  Vibhor  2237837   AIML       Yes         93

In [22]:
df # still it have Grades

     Name     Roll Branch Placement Grades Attendance
0    Rana  2237839   AIML       Yes     A+         90
1   Vijay  2237838   AIML        No     B+         89
2  Vibhor  2237837   AIML       Yes     O+         93

In [34]:
df.drop('Grades',axis = 1, inplace = True)

In [35]:
df

     Name     Roll Branch Placement Attendance
0    Rana  2237839   AIML       Yes         90
1   Vijay  2237838   AIML        No         89
2  Vibhor  2237837   AIML       Yes         93

In [40]:
type('Attendance')

str

In [42]:
## add attendace to column
df['Attendance'] = df['Attendance']+5
df

     Name     Roll Branch Placement  Attendance Grades
0    Rana  2237839   AIML       Yes          95     A+
1   Vijay  2237838   AIML        No          94     B+
2  Vibhor  2237837   AIML       Yes          98     O+

In [43]:
df.drop(0)

     Name     Roll Branch Placement  Attendance Grades
1   Vijay  2237838   AIML        No          94     B+
2  Vibhor  2237837   AIML       Yes          98     O+

In [44]:
df

     Name     Roll Branch Placement  Attendance Grades
0    Rana  2237839   AIML       Yes          95     A+
1   Vijay  2237838   AIML        No          94     B+
2  Vibhor  2237837   AIML       Yes          98     O+